# St7SetSRALoadExcitation

Sets the status of the Load Excitation setting for Spectral Response analysis.

long St7SetSRALoadExcitation(long uID, bool Load)

Input Parameters

uID

Strand7 model file ID.

Load

True to include Base Excitation cases.